app/controllers/outfit_products_controller.rb

SELECT "outfit_products".* FROM "outfit_products"
---
  def index
   render json: OutfitProduct.all

SELECT "outfit_products".* FROM "outfit_products" WHERE "outfit_products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    outfit_product = OutfitProduct.find_by!(id:params[:id])

INSERT INTO "outfit_products" ("outfit_id", "product_id") VALUES (?, ?)  [["outfit_id", 1], ["product_id", 1]]
---
  def create
    outfit_product = OutfitProduct.create!(
      outfit_id: params[:outfit_id],
      product_id: params[:product_id],
    )

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    outfit_product = OutfitProduct.find_by!(id:params[:id])