app/controllers/outfit_products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "outfit_products".* FROM "outfit_products" WHERE "outfit_products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_outfit_product
      @outfit_product = OutfitProduct.find(params[:id])