app/controllers/outfits_controller.rb

  def index
    render json: Outfit.all
---
SELECT "outfits".* FROM "outfits"

  def show
    outfit = Outfit.find_by!(id: params[:id])
---
SELECT "outfits".* FROM "outfits" WHERE "outfits"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    outfit = Outfit.create!(
      name: params[:name],
      latitude: params[:latitude],
      longitude: params[:longitude],
      user_id: params[:user_id]
    )
---
INSERT INTO "outfits" ("name", "latitude", "longitude", "user_id") VALUES (?, ?, ?, ?)  [["name", "testing"], ["latitude", 40], ["longitude", -74], ["user_id", 1]]

  def update
    outfit = Outfit.find_by!(id:params[:id])
    outfit.update(name: params[:name])
---
SELECT "outfits".* FROM "outfits" WHERE "outfits"."id" = ? LIMIT ?  [["id", 1852], ["LIMIT", 1]]
UPDATE "outfits" SET "name" = ? WHERE "outfits"."id" = ?  [["name", "second"], ["id", 2]]

  def destroy
    outfit = Outfit.find_by!(id:params[:id])
    outfit.destroy
---
SELECT "outfits".* FROM "outfits" WHERE "outfits"."id" = ? LIMIT ?  [["id", 1853], ["LIMIT", 1]]
DELETE FROM "outfits" WHERE "outfits"."id" = ?  [["id", 1853]]