app/controllers/products_controller.rb

INSERT INTO "products" ("name", "category", "style", "link") VALUES (?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "link" = ? WHERE "products"."id" = ?  [["link", "https://lp.stories.com/app005prod?set=key[resolve.pixelRatio],value[1]&set=key[resol[…]LLLIFE],ImageVersion[1]&call=url[file:/product/dynamic.chain]"], ["id", 46]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)